<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"530e3a41e82dea2a275727179ef6a89c576c9f43ae5afac3c00567aeb7411d57","plan_job_ref":"Job Plan Airflow DAGs #401 at https://github.com/cal-itp/data-infra/actions/runs/16607207646","plan_out_hash":"33d3bde53ad6a5dfa21c24c362862d8b9e08f74b8b06a2b49599b78f78c427d5","plan_hash":"1d631cf09b67c8336dffa18b037ba0f2dcc7cbf0a937cb1a0958c0eb65098d9e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "UfJCjg==" -> (known after apply)
!~      detect_md5hash      = "4XW2isagZH5zd2S+Ffwq1w==" -> "different hash"
!~      generation          = 1753499810051939 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4XW2isagZH5zd2S+Ffwq1w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "mf3T4A==" -> (known after apply)
!~      detect_md5hash      = "yMVXYKWBO0ZNJNkHUN+zwQ==" -> "different hash"
!~      generation          = 1753499811234496 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "yMVXYKWBO0ZNJNkHUN+zwQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #401](https://github.com/cal-itp/data-infra/actions/runs/16607207646)